## Introduction
#### In many applications, data may be spread across number of files or databases, or be arranged in a for that is not easy to analyze.
#### Knowing how to combine, join and rearrange data is an important skill in the Data Analyst toolkit.

## Hierarchical Indexing
#### It is an important feature in pandas that enables you to have multiple index levels on an axis.
#### It provides a way to work with higher dimensional data in lower dimensional form.
#### When looking at a Series or DataFrame with multi-index, you will see "gaps" in the higher index, which means "same as the one above".

In [1]:
import pandas as pd
import numpy as np

data1 = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'a', 'd'],
                      [1, 2, 3, 1, 3, 1, 2, 4, 3]])

data1                    # Note order matter as a comes again after c completes its indexing

a  1    0.911640
   2    0.311912
   3   -0.134902
b  1    0.576043
   3    1.918134
c  1   -0.412312
   2    0.789493
a  4    0.449735
d  3   -0.625117
dtype: float64

In [2]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 3, 1, 2, 2, 3]])

data

a  1    1.192439
   2   -0.911398
   3   -0.046727
b  1    0.922990
   3    1.205806
c  1    1.944290
   2   -1.243142
d  2   -0.970491
   3    1.376773
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

#### With hierarchical indexed objects, you can perform 'partial indexing', which enables us to concisely select subsets of data.
#### Selection is also possible for "inner" level of indexes.

In [4]:
data['b']

1    0.922990
3    1.205806
dtype: float64

In [5]:
data['b':'c']

b  1    0.922990
   3    1.205806
c  1    1.944290
   2   -1.243142
dtype: float64

In [6]:
data.loc[['b', 'd']]   # data['b', 'd']

b  1    0.922990
   3    1.205806
d  2   -0.970491
   3    1.376773
dtype: float64

In [7]:
data

a  1    1.192439
   2   -0.911398
   3   -0.046727
b  1    0.922990
   3    1.205806
c  1    1.944290
   2   -1.243142
d  2   -0.970491
   3    1.376773
dtype: float64

In [8]:
data.loc[:,2]      # loc index = 2

a   -0.911398
c   -1.243142
d   -0.970491
dtype: float64

#### Hierarchical indexing has important role in reshaping data and group=based operations. eg - forming pivot table.
### You could rearrange data into a DataFrame using its 'unstack' method.
#### The inverse operation of stack is 'stack'.

In [9]:
data

a  1    1.192439
   2   -0.911398
   3   -0.046727
b  1    0.922990
   3    1.205806
c  1    1.944290
   2   -1.243142
d  2   -0.970491
   3    1.376773
dtype: float64

In [10]:
data.unstack()

          1         2         3
a  1.192439 -0.911398 -0.046727
b  0.922990       NaN  1.205806
c  1.944290 -1.243142       NaN
d       NaN -0.970491  1.376773

In [11]:
data.unstack().stack()

a  1    1.192439
   2   -0.911398
   3   -0.046727
b  1    0.922990
   3    1.205806
c  1    1.944290
   2   -1.243142
d  2   -0.970491
   3    1.376773
dtype: float64

#### In a DataFrame, either axis can have hierarchical index.
#### The hierarchical indexes can have names and they will be shown in the console output.
#### NOTE - Be careful not to mix-up index names with row labels.
#### With partial column indexing, we can select groups of columns.
#### A 'MultiIndex' can be created by itself and then reused.

In [32]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a', 'a', 'b', 'b'], [1,2,1,2]],
                    columns = [['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [33]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [35]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                      names = ['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

### Reordering and Sorting Levels
#### Sometimes, we may need to rearrange the order of the levels on an axis or sort the data by values in one specific level.
#### We can use 'swaplevel', which takes 2 level numbers or name and returns a new object with the levels interchanged. The data is unaltered.
#### 'sort_index' sorts the data using the values in a single level.
#### We often use sort_index when swapping levels so that result is lexicographically sorted.
#### NOTE - Data selection performance is better on hierarchically indexed objects if index is lexicographically sorted, starting from outermost level.

### Swap levels i and j in a :class:`MultiIndex`.

### Default is to swap the two innermost levels of the index. and
### if swaplevel(2) ---> swap with 2 and just innermost if availlable and in not innermost remain unchange

In [36]:
frame.swaplevel('key1', 'key2')   # Axis= 0 or 'index', Axis= 1 or 'columns', default 0

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [37]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [38]:
frame.sort_index(level=0)   # Most outermost index is level = 0

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [39]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [40]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [41]:
frame.swaplevel(0,1).sort_index(level=0)    # key 2 has become level1 after swaplevel

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by Level
#### Many Descriptive and Summary statistics on DataFrame and Series have 'level' option, where you can specify the level you want to aggregate by on an axis.
#### we can aggregate on either rows or columns. Under the hood, it utilizes pandas' 'groupby machinery'.

In [42]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [46]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

In [47]:
frame.sum(level='color', axis=1)

TypeError: sum() got an unexpected keyword argument 'level'

### Indexing with a DataFrame's columns
#### We may want to use 1 or more columns as Row Index in DataFrame or alternatively, move row index into columns.
#### The 'set_index' method can create a new DataFrame using 1 or more of its columns as index.
#### By default, columns are removed from the DataFrame, but we can also leave them in.
#### 'reset_index' is the opposite of set_index. It moves hierarchical index levels into columns.

In [49]:
frame = pd.DataFrame({'a': range(7), 'b':range(7,0,-1),
                     'c':['one', 'one', 'one', 'two', 'two',
                          'two', 'two'],
                      'd': [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [50]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [20]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [51]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Combining and Merging Datasets
#### Data in pandas can be combined in many ways:
####     1. 'pandas.merge' connects rows in DataFrames based on 1 or more keys. This is similar to 'join' operations in SQL.
####     2. 'pandas.concat' concatenates or 'stacks' together objects along an axis.
####     3. 'combine_first' method enables splicing together overlapping data to fill in missing values in one object from another.

### Database-Style DataFrame Joins
#### Merge or join combines datasets by linking rows using 1 or more keys. They are central to relational databasees.
#### The 'merge' function in pandas is the main entry point for using these operations on your dataset.
#### We can have a many-to-one join, where 1 object has multiple rows with same index labels whereas the other object has only 1 row for each label. We get a combination of the rows from both objects.

In [52]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','b'],
                   'data1':range(7)})
df2 = pd.DataFrame({'key':['a','b','d'],
                   'data2': range(3)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [53]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [54]:
pd.merge(df1, df2)       # by default how = inner join(intersec) , left (keys first )  then fill   along columnwise(axis =1)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

### It is not necessary to specify which column to join on. 'merge' uses overlapping column names as the keys. But it is a good practice to specify explicitly.
#### If column names are different in the 2 objects, you need to specify them in the merge explicitly.
#### By default, merge does an 'inner join' so keys in the result are intersection or common set found in both objects.There are other possible join options- 'left', 'right' and 'outer'.
#### 'Outer join' does a union of the keys, combining the effect of left and right joins.

In [37]:
pd.merge(df1, df2, on='key')

NameError: name 'df1' is not defined

### left_on = 'lkey' , selecting left frame 'lkey' column 

#### left_on and right_on  must   have atleast one element common is merging mapping is done b/w these

In [38]:
df3 = pd.DataFrame({'lkey': ['b','b','a','c','a','a','b'],
                   'data1':range(7)})
print(df3)
df4 = pd.DataFrame({'rkey':['a','b','d'],
                   'data2': range(3)})
print(df4)

pd.merge(df3, df4, left_on='lkey', right_on='rkey') # Note--> left_on doesn't preserve key order

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6
  rkey  data2
0    a      0
1    b      1
2    d      2

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [39]:
print(df1)
print(df2)
pd.merge(df1, df2, how='outer')    # putting df2 in df1

NameError: name 'df1' is not defined

#### Many-to-many merges have well-defined although not vey intuitive behaviour.
#### They form Cartesian product of the rows. eg- 3 rows on left and 2 rows on right for the same label will lead to 6 rows in the result.

In [40]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a', 'b'],
                   'data1':range(6)})
df2 = pd.DataFrame({'key':['a','b','a','b','d'],
                   'data2': range(5)})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [41]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

## on : label or list

#### Column or index level names to join on. These must be found in both
#### DataFrames. If `on` is None and not merging on indexes then this defaults
#### to the intersection of the columns in both DataFrames.

#### on = along ( key ) as only one common if other common to present create separte column with suffixes

In [77]:
pd.merge(df1, df2, on='key', how='left') # left: use only keys from left frame , preserve key order

   key  data1  data2     _merge
0    b      0    1.0       both
1    b      0    3.0       both
2    b      1    1.0       both
3    b      1    3.0       both
4    a      2    0.0       both
5    a      2    2.0       both
6    c      3    NaN  left_only
7    a      4    0.0       both
8    a      4    2.0       both
9    b      5    1.0       both
10   b      5    3.0       both

In [36]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

#### To merge on multiple keys, pass a list of columns.
#### To determine the key combinations in the result, think an array of tuples formed by the multiple keys being used as a single join key.
#### NOTE - When joining columns on columns, indexes on passed DataFrame objects are discarded.
#### When merging, we may get overlapping column names. We can address manually by renaming the axis labels.
#### 'merge' has a 'suffixes' option for specifying strings to append to overlapping names in left and right objects.

In [34]:
left = pd.DataFrame({'key1':['foo', 'foo', 'bar'],
                    'key2':['one', 'two', 'one'],
                    'lval':[1, 2, 3]})
right = pd.DataFrame({'key1':['foo', 'foo', 'bar', 'bar'],
                     'key2': ['one', 'one', 'one', 'two'],
                     'rval': [4, 5, 6, 7]})

pd.merge(left, right, on=['key1', 'key2'], how='outer' , indicator = "Category")

  key1 key2  lval  rval    Category
0  foo  one   1.0   4.0        both
1  foo  one   1.0   5.0        both
2  foo  two   2.0   NaN   left_only
3  bar  one   3.0   6.0        both
4  bar  two   NaN   7.0  right_only

####  Problem is that there are columns you are not merging on that are common to both source DataFrames. Pandas needs a way to say which one came from where, so it adds the suffixes, the defaults being '_x' on the left and '_y' on the right.

### make key1 as only one common column

In [35]:
print(left)
print(right)
pd.merge(left, right, on='key1' , indicator = True)

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3
  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

  key1 key2_x  lval key2_y  rval _merge
0  foo    one     1    one     4   both
1  foo    one     1    one     5   both
2  foo    two     2    one     4   both
3  foo    two     2    one     5   both
4  bar    one     3    one     6   both
5  bar    one     3    two     7   both

In [36]:
pd.merge(left, right, on=['key1' ,'key2' ], indicator = True)  # made key1 and key2 as common column

  key1 key2  lval  rval _merge
0  foo  one     1     4   both
1  foo  one     1     5   both
2  bar  one     3     6   both

In [74]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right') , indicator = True )

  key1 key2_left  lval key2_right  rval _merge
0  foo       one     1        one     4   both
1  foo       one     1        one     5   both
2  foo       two     2        one     4   both
3  foo       two     2        one     5   both
4  bar       one     3        one     6   both
5  bar       one     3        two     7   both

### Merging on Index
#### scenarios, the index will contain the key(s) along which the objects need to be merged.
#### You can pass 'left_index=True' or 'right_index=True' or both to indicate which index should be used to merge.
#### The default method for merge is to intersect join keys. But we can instead form 'union' with an 'outer_join'.

In [3]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],
                     'value':range(6)})
right1 = pd.DataFrame({'group_val':[3.5, 7]}, index=['a','b'])

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [4]:
right1

   group_val
a        3.5
b        7.0

#### right_index : bool, default False Use the index from the right DataFrame as the join key. Same caveats as left_index

### Can only pass argument "left_on" OR "left_index" not both for either side, it must passed for both mixup is allowed

In [6]:
pd.merge(left1, right1, left_on='key', right_index=True)    # left_on: 'IndexLabel'

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [46]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

#### Things are more complicated with hierarchically indexed data, as joining on index is implicitly multi-key merge.
#### You can indicate multiple columns to merge as a list. And handle duplicate data with 'how=outer'.
#### Using the indexes of both sides is also possible.

In [16]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                     'key2': [2000, 2001, 2002, 2001, 2002],
                     'data': np.arange(5.)})
righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                     index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                            'Ohio', 'Ohio'], [2001, 2000, 2000, 2000, 2001, 2002]],
                     columns=['event1', 'event2'])

lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [17]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

#### right_index=True parameter  is used to indicate that the index of the right DataFrame should be used as the key for merging. In other words, it specifies that the merge operation should be based on the index values of the right DataFrame

### left_index from the left DataFrame as the join key in merge(leftdataframe,something  )

In [14]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [28]:
print(lefth)
print(righth)

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0
             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [24]:
pd.merge(lefth, righth, right_on=['event1'], left_index=True)

               key1  key2  data  event1  event2
Nevada 2001    Ohio  2000   0.0       0       1
       2000    Ohio  2002   2.0       2       3
Ohio   2000  Nevada  2002   4.0       4       5

In [51]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], 
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [42]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                    index=['a', 'c', 'e'],
                    columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                     index=['b','c','d','e'],
                     columns=['Missouri','Alabama'])

left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [43]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [44]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

#### Dataframe has a 'join' method for merging by index. It can also be used to combine together many DataFrame objects that have similar indexes but non-overlapping columns.
#### Mostly for legacy reasons, the join method performs a left join on the keys, preserving the left frame's ro index.
#### It also supports joining the index of passed DataFrame on one of the columns of the calling DataFrame.
#### For index-on-index merges, you can pass a list of DataFrames to join instead of using the 'concat' function.

In [47]:
print(left2)
print(right2)

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0
   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [45]:
left2.join(right2, how='outer')   # c and e are common index

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [48]:
print(left1)
print(right1)

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5
   group_val
a        3.5
b        7.0

In [57]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [49]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                      index=['a', 'c', 'e', 'f'],
                      columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [50]:
print(left2)
print(right2)

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0
   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [59]:
left2.join( [right2, another] )  # join based on left2

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [60]:
left2.join( [right2, another], how='outer')

C:\Users\adity\Anaconda3\lib\site-packages\pandas\core\frame.py:6359: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  verify_integrity=True)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

### Concatenating along an Axis
#### Another data concatenation method is interchangeably known as concatenation, binding or stacking.
#### NumPy has 'concatenate' which performs this on NumPy arrays.

In [53]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

### by default axis=0 put other down of another

In [54]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

#### In pandas' objects, we have labelled axes, which help us in generalizing array concatenation.
#### There are a few things to think about before concatenating pandas objects:
####     1. If the 2 objects are indexed differently on the other axis, should we combine the distinct element or use only the shared values along that axis (intersection)?
####     2. Do the concatenated chunks need to be identifiable in the resulting object?
####     3. Does the 'concatenating axis' have sata that needs to be preserved? In general, integer labels should best be discarded during concatenation.
#### The 'concat' method provides a consistent way to address the above issues.
#### For 'Series' with no overlap, concat just glues the values and indexes.
#### By default, it works along 'axis=0', but if we pass 'axis=1', teh result will be a DataFrame (axis=1 is for columns).

In [55]:
s1 = pd.Series([0,1], index=['a', 'b'])
s2 = pd.Series([2,3,4], index=['c', 'd', 'e'])
s3 = pd.Series([5,6], index=['f', 'g'])

In [56]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [57]:
pd.concat( [s1, s2, s3], axis=1 )

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

#### If there is no overlap on the other axis (like above example), we see a 'sorted union' (or outer join).
#### You can get an intersect by passing "join='inner'".
#### If you want to specify the axes to be used in 'other axes' do it with 'join_axes'.

In [70]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [72]:
pd.concat([s1, s4], axis=1)

C:\Users\adity\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [73]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [74]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

#### Another issue is to identify concatenated pieces in the result. To create a hierarchical index in the concatenated axis, we can use the 'keys' argument.
#### When we use axis=1, the keys become column headers. This is true to both Series and DataFrame.
#### If we pass a dict of objects instead of a list, then dict's keys will be used for the 'keys' option.
#### There are other arguments in hierarchical index creation. eg - To name a created axis just use the 'names' argument.

In [58]:
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [77]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [78]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

C:\Users\adity\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [59]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a', 'b', 'c'],
                  columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a', 'c'],
                  columns=['three', 'four'])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [60]:
df2

   three  four
a      5     6
c      7     8

In [82]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

C:\Users\adity\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [83]:
pd.concat({'level1':df1, 'level2': df2}, axis=1)

C:\Users\adity\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [84]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
         names=['upper', 'lower'])     # Names for the levels in the resulting hierarchical index.

C:\Users\adity\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

#### The last issue is that the row index does not contain any relevant data.
#### To avoid this, pass 'ignore_index=True'.

In [61]:
df1 = pd.DataFrame(np.random.randn(3,4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2,3), columns=['b', 'd', 'a'])
df1

          a         b         c         d
0 -0.176058  0.945154  0.787717  1.198604
1 -0.081324 -1.243238 -0.579609 -1.344786
2 -2.165845  0.549739  0.175005  0.210575

In [62]:
df2

          b         d         a
0 -0.568098 -0.133418 -1.160955
1 -1.659077  0.069537  0.432060

In [63]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.176058  0.945154  0.787717  1.198604
1 -0.081324 -1.243238 -0.579609 -1.344786
2 -2.165845  0.549739  0.175005  0.210575
3 -1.160955 -0.568098       NaN -0.133418
4  0.432060 -1.659077       NaN  0.069537

## Reshaping and Pivoting
#### There are a number of basic operations for rearranging tabular data. These are called 'reshape' or 'pivot' operations.

### Reshaping with Hierarchical Indexing
#### Hierarchical indexing allows to rearrange data consistently in a DataFrame. There are 2 primary actions:
####     1. stack - It 'rotates' or pivots from columns to rows.
####     2. unstack - Pivots rows into columns.
#### Calling 'stack' pivots columns into rows, producing a Series.
#### If you have a hierarchically indexed Series, we can rearrange the data back into a DataFrame with 'unstack'.

In [64]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index=pd.Index(['Ohio', 'Colorado'], name='state'),
                   columns = pd.Index(['one', 'two', 'three'],
                                     name = 'number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [65]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [104]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#### By default the innermost index gets 'stacked' or 'unstacked'. You can unstack a different level by passing a level number or name.
#### Unstacking might introduce missing data if all values in the level aren't foundin each subgroups.

In [106]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [107]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [66]:
s1 = pd.Series([0,1,2,3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4,5,6], index=['c','d','e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])

data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [109]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

#### Stacking filters out missing data by default, so that the operation is easily invertible.
#### When you unstack, the level unstacked becomes lowest level in the result.
#### when calling stack or unstack, we can indicate the name of the axis to the stack.

In [111]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [113]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [114]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [68]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [67]:
df = pd.DataFrame( {'left': result, 'right': result+5 },
                 columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [116]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [117]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7